app/controllers/api/v1/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "me@brian.biz"], ["LIMIT", 1]]
---
  def index
    users = User.where.not(email: 'admin@brian.biz')

SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT $2  [["uid", "me@brian.biz"], ["LIMIT", 1]]
---
  def show
    user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT $2  [["uid", "me@brian.biz"], ["LIMIT", 1]]
INSERT INTO "transactions" ("from_id", "to_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["from_id", 1], ["to_id", 6], ["amount", 10.0], ["created_at", "2018-06-19 17:25:27.829701"], ["updated_at", "2018-06-19 17:25:27.829701"]]
---
  def make_payment
    if user_signed_in?
      user = User.find(params[:user_id])
      amount = params[:amount]

      transaction = current_user.transactions.build({amount: amount})
      transaction.to = user
      transaction.save!