app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "admin@brian.biz"], ["LIMIT", 1]]
INSERT INTO "transactions" ("from_id", "to_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["from_id", 4], ["to_id", 4], ["created_at", "2018-06-19 15:58:40.403009"], ["updated_at", "2018-06-19 15:58:40.403009"]]
---
  def set_default_amount
    admin = User.find_by_email('admin@brian.biz')

    transaction = admin.transactions.build({amount: 100})
    transaction.to = self
    transaction.save!

SELECT "transactions".* FROM "transactions" WHERE "transactions"."to_id" = $1  [["to_id", 1]]
---
  def balance
    # UTXO like but in psql
     Transaction.where(to: self.id).sum { |t| t.amount } - self.transactions.sum { |t| t.amount }